{
  "app.head.menu.home": "Home",
  "app.head.menu.document": "Document",
  "app.head.menu.teams": "Team",
  "app.head.menu.media": "Media Report",
  "app.head.menu.blog": "Blog",
  "app.head.menu.join": "Join Us",

  "app.home.title": "where Valuable Bits Are Exchanged and Validated",
  "app.home.ourselves.title": "What is Conflux?",
  "app.home.ourselves.content": "Conflux is the first also the only public blockchain system till now ，which can achieve high TPS without sacrificing decentralization or safety. By delicately combining its unique and advanced algorithm with a novel structure——Tree Graph (TG), Conflux makes consensus no longer a performance bottleneck, which can solve a series of problems in the landing industrialization of public chains. Currently, in its first stage, Conflux adopts the PoW (Proof of Work) mechanism as the basis of its consensus.",
  "app.home.ourselves.btn": "Conflux Introduction",
  "app.home.property.title": "What is the high-efficiency public blockchain ?",
  "app.home.property.item1.name": "Trustworthy and Participatory",
  "app.home.property.item1.content": "The core value of blockchain is that it establishes a trustworthy and participatory decentralized platform without relying on the endorsement of any organization or individual. Importantly, Conflux serves to maximize this core value. It permits anyone to participate in the public blockchain consensus even without holding any stock share. Conflux inherited the central design idea of Bitcoin system: Computing power is the only weapon in competing for the right of block generation. Additionally, in Conflux, the order of all transactions is solely determined by the DAG structure. Conflux strives to prevent illegal transactions – each and every transaction in the core chain is examined by all nodes of the network. The strict algorithm design and the comprehensive theoretical analysis of Conflux protect itself from most attacks. More importantly, Conflux pursuiting the efficiency without sacrificing fany of its safety, decentralization or trustworthiness.",
  "app.home.property.item2.name": "Versatility of Application",
  "app.home.property.item2.content": "Most of the PoW-based blockchain systems currently in the field (e.g., Bitcoin and Ethereum) have a very limited transaction throughput rate, which is far lower than the centralized transaction services like Visa that can support the execution of >1,000 transactions per second. Such a low throughput rate restricts the possibility of exploiting more meaningful applications from blockchain systems. By adopting a DAG structure, Conflux realized a high throughput rate of 3000-6000 TPS in our internal network testing without compromising decentralization. In the future, we anticipate that Conflux will have versatile applications in many fields, such as financial transactions, Internet ID, Internet of things as well as property rights.",
  "app.home.product.title": "Technical Highlight",
  "app.home.product.item1.title": "Scalability",
  "app.home.product.item1.content": "By adopting an scalability consensus mechanism and safely retaining fork blocks, Conflux realized a high throughput rate of 3000-6000 TPS in our real-network testing.",
  "app.home.product.item2.title": "Security",
  "app.home.product.item2.content": "From anti-double spend attack protection (consensus-level) to contract code proofreading (application-level), Conflux’s advanced technology provides strong protection in all aspects and all levels of the system.",
  "app.home.product.item3.title": "Extensibility",
  "app.home.product.item3.content": "Conflux will use blockchain oracle in combination with cryptographic tools to realize powerful features such as external data feeding and confidential data control, which can greatly increase the versatility of Conflux’s application.",
  "app.home.roudmap.title": "Roadmap",
  "app.home.roudmap.period1": "Project Launch",
  "app.home.roudmap.period2": "Prototype Implementation and Internal Test-net Launch",
  "app.home.roudmap.period3": "Private-round Investment",
  "app.home.roudmap.period4": "Public Test-net Launch",
  "app.home.roudmap.period5": "Main-net Launch",
  "app.home.roudmap.period6": "Extensible Smart-contract Network Upgrade",

  "app.document.title": "Technical Presentation",
  "app.document.content": "Conflux is a fast, scalable and decentralized blockchain system that optimistically process concurrent blocks without discarding any as forks. The Conflux consensus protocol represents relationships between blocks as a direct acyclic graph and achieves consensus on a total order of the blocks. Conflux then, from the block order, deterministically derives a transaction total order as the blockchain ledger. We evaluated Conflux on Amazon EC2 clusters with up to 20k full nodes. Conflux achieves a transaction throughput of 5.76GB/h while confirming transactions in 4.5-7.4 minutes. The throughput is equivalent to 3000～6000 transactions per second for typical Bitcoin transactions. Our results also indicate that when running Conflux, the consensus protocol is no longer the throughput bottleneck. The bottleneck is instead at the processing capability of individual nodes.",
  "app.document.paper": "Academic Paper",
  "app.document.technical": "Technical Presentation",
  "app.document.develop": "Developer Documents",
  "app.document.lang": "EN",

  "app.teams.title": "Our Team",
  "app.teams.intro": "The founding team consists of computer scientists with strong oversea educational backgrounds in the U.S. and it also includes the veterans from top technology and financial companies in Silicon Valley and Wall Street, and prominent and well-recognized scientists and researchers in high-quality research organizations, who focus on distributed system, programming language, cyber security, cryptography and game theory, etc. Core members are all from top universities including Massachusetts Institute of Technology (MIT), Carnegie Mellon University (CMU), and University of Illinois at Urbana-Champaign (UIUC), Tsinghua University, Shanghai Jiao Tong University , University of Science and Technology of China etc. Most members in the team have the background of information science or mathematical contest, with gold metal of ACM International Collegiate Programming Contest etc.",
  "app.teams.founder.title": "Founding Team",
  "app.teams.founder.longfan.name": "Fan Long",
  "app.teams.founder.longfan.title": "Co-Founder",
  "app.teams.founder.longfan.desc": "Fan Long, an Assistant Professor at University of Toronto. He graduated from Tsinghua University Yao Class, and he holds Ph.D of Computer Science from MIT. His research interests include systems security, programming language, and blockchain. He is a recipient of ACM SIGSOFT Outstanding Dissertation Award and MIT Best Dissertation Award. He has more than 20 publications on top computer science conferences with more than 1000 citations. He was also a competitive programmer. He won gold medals twice in International Olympiad of Informatics (2005, 2006), and ACM-ICPC Programming Contest regional championship.",
  "app.teams.founder.yaoqizhi.name": "Andrew Chi-Chih Yao",
  "app.teams.founder.yaoqizhi.title": "Chief Scientist",
  "app.teams.founder.yaoqizhi.desc": "Professor Yao is a world-renowned computer scientist. He is recipient of the Turing Award in 2000 for his fundamental contributions to the theory of computation, including the complexity-based theory of pseudorandom number generation, cryptography, and communication complexity. He is an academician of the Chinese Academy of Sciences, a foreign member of the US National Academy of Sciences. He is a Professor and Dean of the Institute for Interdisciplinary Information Sciences at Tsinghua University. Andrew is the Chief Scientist of the Conflux Chain Foundation and will lead the theoretical design of the Conflux protocol.",
  "app.teams.founder.xuwei.name": "Wei Xu",
  "app.teams.founder.xuwei.title": "Research Scientist",
  "app.teams.founder.xuwei.desc": "Wei Xu, Assistant Professor and Assistant Dean of the Institute of Interdisciplinary Information Science(IIIS), Tsinghua University. He is also the Associate Dean of the Institute of Financial Technology of Tsinghua University and Director of the Blockchain Research Center. Professor Wei Xu’s research interests focus on cross-disciplinary research in distributed systems and machine learning. He obtained his Master and and Ph.D. degree in Computer Science from University of California, Berkeley. He was advised by Professor David Patterson, winner of the 2017 Turing Award. He holds a bachelor's degree in computer science from the University of Pennsylvania (he also spent two years in the Department of Computer Science at Tsinghua University). He has won Faculty Research Awards from Google and IBM, Graduate Student Advising Award and Top-Performance Employee Award from Tsinghua University, and Beijing Teaching Pioneer Award. He has published more than 40 papers in top conferences in systems, networks, machine learning, and optical communications, etc. He won the DSN, APSys Best Paper Award. Prior to joining Tsinghua, he worked at Google headquarters and was responsible for R&D in infrastructure reliability.",
  "app.teams.founder.wuming.name": "Ming Wu",
  "app.teams.founder.wuming.title": "CTO",
  "app.teams.founder.wuming.desc": "Ming Wu is the founding member of Conflux. Before joining the Conflux Team, Ming was a senior researcher at Systems Research Group in Microsoft Research Asia. He has extensive expertise in the design and implementation of distributed systems. He designed and implemented the large-scale and highly efficient distributed machine learning systems which were applied in Microsoft products. Dr. Ming Wu graduated from University of Science and Technology of China, and he obtained a Ph.D. in computer science from the Institute of Computing Technology, Chinese Academy of Science in 2007. Later in 2007, he joined Microsoft Research Asia. His main research interests and research directions involve distributed transaction processing systems, graph computing engines and artificial intelligence platforms. Dr. Ming Wu has published many papers in top conferences in computer system area, such as SOSP, OSDI, NSDI, ATC, EuroSys, SoCC, VLDB, etc. He has also served as Committee Member of OSDI, ASPLOS, HotDep, and MiddleWare, and he is the publication Chair of SOSP'17.",
  "app.teams.founder.zhoudong.name": "David Chow",
  "app.teams.founder.zhoudong.title": "Co-Founder",
  "app.teams.founder.zhoudong.desc": "David Chow graduated from Tsinghua University Yao Class. His research interests include networking, systems, and blockchain. David was a system architect at an industry-leading automated trading firm, where he designed and optimized the infrastructures for large scale high-frequency trading. He was a competitive programmer who won gold medal in International Olympiad of Informatics, and regional championship in ACM-ICPC competition Programming Contest.",
  "app.teams.engineer.title": "Engineering Team",
  "app.teams.engineer.yangguang.name": "Guang yang",
  "app.teams.engineer.yangguang.title": "Research Director",
  "app.teams.engineer.yangguang.desc": "Guang Yang graduated from Tsinghua University Yao Class and he received his Ph.D degree in Computer Science from IIIS at Tsinghua. After graduation, Guang did research at Aarhus University, Institute of Computing Technology Chinese Academy of Sciences, and Bitmain. His research interests include cryptography, game theory, and blockchain. He is a recipient of the CACR Excellent Doctoral Dissertation Award. He has published over 10 papers on top conferences in theory and cryptography, including CRYPTO, CCC, TCC, AAMAS, and ICML. He is also a math enthusiast (as an academic descendent of Leonhard Euler). He won a gold medal of the Chinese Mathematical Olympiad (2006).",
  "app.teams.engineer.yangzhe.name": "Zhe Yang",
  "app.teams.engineer.yangzhe.title": "Core System & Infrastructure Engineer",
  "app.teams.engineer.yangzhe.desc": "Zhe Yang graduated from Tsinghua University (he once studied at Yao Class, and later graduated from Department of Mathematics), and he published a paper at top computer theory conference CRYPTO when he was still a senior student at Tsinghua. After graduating from Tsinghua, Zhe worked at Hulu, Face++, and Google, and has more than 7-years extensive experience in P2P streaming, AI, CDN, and Engineering Productivity. Zhe Yang was a competitive programmer who won the gold medal in the National Olympiad of Informatics and regional championship in ACM-ICPC competition Program Contest.",
  "app.teams.engineer.liuyanpei.name": "Yanpei Liu",
  "app.teams.engineer.liuyanpei.title": "Core System & Infrastructure Engineer",
  "app.teams.engineer.liuyanpei.desc": "Yanpei Liu graduated from the ACM Hornor Class of Shanghai Jiaotong University. Before joining the Conflux team, he was an investment analyst at Sequoia Capital China, where he was responsible for the analysis and investment of hard tech startups. Besides that, Yanpei is a competitive hacker. He was the finalist of Google Code Jam, Facebook Hackercup and ACM-ICPC World Finals (Gold Medal, Second Place and Asia Champion).",
  "app.teams.engineer.lichenxing.name": "Chenxing Li",
  "app.teams.engineer.lichenxing.title": "Algorithm Engineer/Researcher",
  "app.teams.engineer.lichenxing.desc": "Chenxing Li graduated from Yao Class, Tsinghua University. He is currently a Ph.D. student at the Institute of Interdisciplinary Information at Tsinghua University, advised by professor Andrew Yao. Chenxing's research interests include: applied cryptography and blockchain consensus algorithm. He has won the bronze medals of Yao Award and the gold medals of the Chinese Mathematical Olympiad.",
  "app.teams.engineer.lipeilun.name": "Peilun Li",
  "app.teams.engineer.lipeilun.title": "System Engineer/Researcher",
  "app.teams.engineer.lipeilun.desc": "Peilun Li graduated from Yao Class, Tsinghua University. He is currently a Ph.D. student at the Institute of Interdisciplinary Information at Tsinghua University. Peilun's research interests include distributed systems and blockchain consensus algorithms. He has won first class award in the regional physics competition.",
  "app.teams.operation.title": "Operation Team",
  "app.teams.operation.zhangyuanjie.name": "YuanJie Zhang",
  "app.teams.operation.zhangyuanjie.title": "COO",
  "app.teams.operation.zhangyuanjie.desc": "YuanJie Zhang holds a BA from Fudan University, and MA from Brandeis University. Before joining the Conflux Team, Yuanjie worked at Huatai private fund of Funds, UNC endowment management company and Novus( fintech startup) in Wall Street. He has expertise in investments, capital markets and business operations. He helped the fundraising of Conflux, and he is in charge of daily operation.",
  "app.teams.operation.wangjingnan.name": "Jingnan Wang",
  "app.teams.operation.wangjingnan.title": "VP",
  "app.teams.operation.wangjingnan.desc": "Jingnan Wang spent 7 years studying at Beijing Normal University, attaining both his bachler's and master's degree there. Before joining the Conflux Team, Jingnan worked at Hejun Consulting Group, Acer, and ZIFSC. He is an expert in government relationships and cooperation.",
  "app.teams.operation.mengziyu.name": "Ziyu Meng",
  "app.teams.operation.mengziyu.title": "Administrative Manager",
  "app.teams.operation.mengziyu.desc": "Ziyu earned a Master of Science in Economy Management from University of Paris 1 Panthéon-Sorbonne and University of Paris 2 Panthéon-Assas. Before joining the Conflux Team, she worked at Huawei Technologies France and Auchan Retail China. She has deep working experience in project management.",
  "app.teams.operation.sunquan.name": "Quan Sun",
  "app.teams.operation.sunquan.title": "Finance Manager",
  "app.teams.operation.sunquan.desc": "Quan is a well-qualified and diligent finance manager. She has experiences and proven accomplishments in building financial reporting system and controlling cash flow for start-up company. She is responsible for providing effective financial information to the management team, which could help the team make decisions based on company’s own business model and specialties. Sun Quan once worked at the financial management team of a leading investment bank in North America. She improved her leadership skills through cooperations with the team.",
  "app.teams.operation.shiyongling.name": "Yongling Shi",
  "app.teams.operation.shiyongling.title": "HR Manager",
  "app.teams.operation.shiyongling.desc": "Yongling has many years HR experience in Internet and Blockchain industry. Before joining Conflux，she worked at Huobi.",

  "app.media.item1.title": "Notable Investors Pursuing DApp Protocol Conflux Despite Market Concern",
  "app.media.item1.content": "Conflux, a blockchain protocol based on Proof of Work, that has been aimed at China’s tech giants as a decentralised, scalable, dApp blockchain solution has garnered much attention from some well-regarded investors.",
  "app.media.item2.title": "A Faster Bitcoin? Conflux Raises $35 Million from Chinese Web Giants for New Blockchain Protocol",
  "app.media.item2.content": "A big knock on Bitcoin is that its underlying technology is too slow to be a useful real world ledger. And while developers are tinkering with a variety of fixes—to Bitcoin and other decentralized blockchain protocols—they have yet to solve the speed problem.",
  "app.media.item3.title": "DeepTech Exclusive interview A startup team from Tsinghua University Yao-class raised $35M funding against deficit market: a commitment of conquering the fundamental problem of blockchain using hard power",
  "app.media.item3.content": "刚过去的 12 月是区块链行业跌到谷底的一个月。统计显示，上半年热火朝天的 ICO，在 12 月全球总额萎缩到近乎为零。但同一个月，一个由多名“清华姚班”组成的项目 Conflux 却打破市场沉寂，宣布融资 3500 万美元，还吸引 Fortune、Coindesk 等多家重量級外媒报道，让整个行业都亟欲想了解这一团队。",
  "app.media.item4.title": "36kr interview Conflux CTO, Dr. Ming Wu: How we broke the public blockchain system’s throughput bottleneck caused by the PoW-based consensus mechanism",
  "app.media.item4.content": "Conflux CTO伍鸣：让POW的共识机制不再成为公链系统吞吐率的瓶颈 | P.O.D新区势峰会Odaily星球日报 • 2018-11-30 • 内容“分叉对计算和网络资源造成浪费且危害安全“ Conflux CTO伍鸣：让POW的共识机制不再成为公链系统吞吐率的瓶颈 | P.O.D新区势峰会11月28日。",

  "app.blog.item1.title": "Why It Is Better for a New Blockchain to Start with Proof-of-Work?",
  "app.blog.item1.content": "It is impossible for an Internet or financial company to be commissioned by users for trillion-dollars transactions without strong technical capabilities, p- muscular financial strength, as well as endorsement by governments and other large companies. However, Bitcoin has supported transactions worth a trillion dollars in the past year without any government or company endorsement. This phenomenal success...",
  "app.blog.item2.title": "Use DAG structure to enhance the throughput rate of Nakamoto...",
  "app.blog.item2.content": "Dr. Wu received his undergraduate education from the University of Science and Technology, China, and received his Ph.D. degree from Chinese Academy of Science in the major of computer system structure. He used to work as a senior researcher in the system research group of MSRA, studying distributed...",
  "app.blog.item3.title": "Review of Conflux & TokenGazer AMA Meetup",
  "app.blog.item3.content": "Conflux was invited to attend the online Q&A meetup host , on which Dr. Ming Wu, CTO of Conflux, had in-depth discussions and shared his scientific thoughts with more than 100 participating researchers...",
  "app.blog.item4.title": "",
  "app.blog.item4.content": "",
  "app.blog.btn.more": "More",

  "app.join.header.title": "Company Profile",
  "app.join.header.item1": "Conflux is a blockchain technology company focused on the development of technologies and infrastructure for distributed systems. In addition to the development of the infrastructure and system, Conflux is committed to figuring out real-world scenarios with strategic partners, and to developing distributed applications that can be integrated with traditional business models.",
  "app.join.header.item2": "The goal of the company is to gradually use technology to create the next generation of distributed systems. We aim to promote the integration of technology and business with advanced blockchain technology, and we strive to collaborate the resources from technology, industry, business and all other aspects to achieve the goal.",
  "app.join.header.item3": "The investors of the Conflux include large Chinese Internet companies, financial institutions and top venture capital funds and overseas investment institutions.",
  "app.join.benefits.title": "Benefits",
  "app.join.benefits.item1": "Free Lunch",
  "app.join.benefits.item2": "Flexible Working Hours",
  "app.join.benefits.item3": "Free Physical Examination",
  "app.join.benefits.item4": "Attractive Salary and Benefits",
  "app.join.position.title": "招聘职位",
  "app.join.position.place.title": "Workplace:",
  "app.join.position.place.content": "beijing",
  "app.join.position.time.title": "Release Time:",
  "app.join.position.desc.title": "Position Descriptions:",
  "app.join.position.require.title": "Job Responsibilities:",
  "app.join.position.product.title": "高级产品经理",
  "app.join.position.product.position1": "1.负责公司主网、社区论坛及数字资产产品的核心模块设计及发展规划；",
  "app.join.position.product.position2": "2.设计并利用数据回收机制，指导产品优化并进行迭代效果监控；",
  "app.join.position.product.position3": "3.负责竞争产品、行业产品、行业相关信息及全球用户生态的调研和深度分析；",
  "app.join.position.product.position4": "4.对产品生命周期进行分析、测算，对产品的长期发展战略提出建设性意见；",
  "app.join.position.product.position5": "5. 协调相关部门推动产品周期。",
  "app.join.position.product.require1": "1.统招本科学历及以上，6年及以上互联网产品经验，有行业相关产品经验或知名公司高级职务经历者优先；",
  "app.join.position.product.require2": "2.对区块链技术感兴趣，并对所面向的用户群体具有较为深刻的认知；",
  "app.join.position.product.require3": "3.精通互联网产品整体实现过程，包括从需求分析到产品发布，有敏锐的市场洞察能力，严密的逻辑分析能力，良好的沟通协作能力，以及一定的技术理解能力；",
  "app.join.position.product.require4": "4.具有较强的目标导向意识和执行力，能领导并指导产品团队高效完成目标；",
  "app.join.position.product.require5": "5.能很好的控制项目进度和质量，协调相关人员共同完成任务；",
  "app.join.position.product.require6": "6.具有优秀的交互设计功底，在用户体验设计上追求极致。",
  "app.join.position.frontend.title": "资深前端工程师",
  "app.join.position.frontend.position1": "1.协助负责产品前端架构的建立和实施，前端框架开发；",
  "app.join.position.frontend.position2": "2.优化前端架构，功能模块化，抽象化UI组件；",
  "app.join.position.frontend.position3": "3.推动前端工程化，自动化和工具化建设；",
  "app.join.position.frontend.position4": "4.维护和升级本地开发环境，提高开发效率，提升开发质量。",
  "app.join.position.frontend.require1": "1.本科及以上学历，计算机相关专业，五年以上WEB前端工作经验；",
  "app.join.position.frontend.require2": "2.熟悉React、Redux等相关主流框架和技术；",
  "app.join.position.frontend.require3": "3.主导或深度实践过前端工程化、组件化；",
  "app.join.position.frontend.require4": "4.基本功扎实，对代码质量有很高的追求，具有良好的编程能力和编程习惯；",
  "app.join.position.frontend.require5": "5.具有较强的分析和解决问题能力，较强的责任心，良好的沟通学习能力和团队合作精神；",
  "app.join.position.frontend.require6": "6.对未知领域有快速学习、探索和研究的能力。",

  "app.foot.privacy": "Privacy Policy",
  "app.foot.terms": "Terms",
  "app.foot.faqs": "FAQs"
}
